<a href="https://colab.research.google.com/github/NastiiaZ/dpassignement/blob/main/Copy_of_DBWEEK9LAB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db/")
print(my_conn.name)

sqlite

In [ ]:
r_set=my_conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in r_set:
  print(row)

In [ ]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

In [ ]:
r_set=my_conn.execute('''SELECT * FROM subcategory''');
for row in r_set:
  print(row)

In [ ]:
# display all records of particular class only
q="SELECT id, name, class, mark, sex FROM student WHERE class='Four'"
my_cursor=my_conn.execute(q)
for row in my_cursor:
  print(row)

In [ ]:
my_cursor = my_conn.execute("select id, name, class, mark, sex from student where id = 8")
data_row = my_cursor.fetchone()

print(data_row)

#we retrive id only from row 8

None

In [ ]:
# select 10 records only; used for filtering technigue from 1 to 10, because page has limitations; we can choose limit
q="SELECT id, name, class, mark, sex FROM student limit 0,10"
my_cursor=my_conn.execute(q)
data_row=my_cursor.fetchall()
print(type(data_row))
print("No of records : {}".format(len(data_row)))
for row in data_row:
  print(row)

<class 'list'>
No of records : 0

In [ ]:
# delete sample table student used for deleting tables, if table is empty and u want to delete it, then u get error
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''DROP table student;''')
  print("student table deleted")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)
  #print(e)

student table deleted

In [ ]:
# creating student table
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''
    CREATE TABLE IF NOT EXISTS student(id integer primary key,
                                       name text,
                                       class text,
                                       mark integer,
                                       sex text
                                       );''')
  
  print("Student Table created successfully")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)

Student Table created successfully

In [ ]:
# add records to student table
r_set=my_conn.execute('''INSERT INTO `student`
(`id`,`name`,`class`,`mark`,`sex`) VALUES
(1, 'John Deo', 'Four', 75, 'female'),
(2, 'Max Ruin', 'Three', 85, 'male'),
(3, 'Arnold', 'Three', 55, 'male'),
(4, 'Krish Star', 'Four', 60, 'female'),
(5, 'John Mike', 'Four', 60, 'female'),
(6, 'Alex John', 'Four', 55, 'male'),
(7, 'My John Rob', 'Five', 78, 'male'),
(8, 'Asruid', 'Five', 85, 'male'),
(9, 'Tes Qry', 'Six', 78, 'male'),
(10, 'Big John', 'Four', 55, 'female'),
(11, 'Ronald', 'Six', 89, 'female'),
(27, 'Big Nose', 'Three', 81, 'female'),
(28, 'Rojj Base', 'Seven', 86, 'female'),
(29, 'Tess Played', 'Seven', 55, 'male'),
(30, 'Reppy Red', 'Six', 79, 'female'),
(31, 'Marry Toeey', 'Four', 88, 'male'),
(32, 'Binn Rott', 'Seven', 90, 'female'),
(33, 'Kenn Rein', 'Six', 96, 'female'),
(34, 'Gain Toe', 'Seven', 69, 'male'),
(35, 'Rows Noump', 'Six', 88, 'female');''')

In [ ]:
my_conn = create_engine("sqlite:///my_db2.db")
conn = my_conn.connect()

!ls

'my_db (1).db'	 my_db.db      student_insert.sql
 my_db2.db	 sample_data   student_tables.sql

In [ ]:
# delete sample table student
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''DROP table student;''')
  print("student table deleted")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)
  #print(e)

student table deleted

In [ ]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db/")

# Show the list of tables
r_set = my_conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in r_set:
    print(row)

In [ ]:

# Open file and run script
with open("student_tables.sql", "r") as file:
    query = file.read()
    my_conn.execute(query)

# Show the list of tables
r_set = my_conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
for row in r_set:
    print(row)

('student',)

In [ ]:
with open("student_insert.sql", "r") as file:
    query = file.read()
    my_conn.execute(query)

r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark=mark+1"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  20

In [ ]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 76, 'female')
(2, 'Max Ruin', 'Three', 86, 'male')
(3, 'Arnold', 'Three', 56, 'male')
(4, 'Krish Star', 'Four', 61, 'female')
(5, 'John Mike', 'Four', 61, 'female')
(6, 'Alex John', 'Four', 56, 'male')
(7, 'My John Rob', 'Five', 79, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 56, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Three', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 89, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark=mark+1 WHERE id=7"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  1

In [ ]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 76, 'female')
(2, 'Max Ruin', 'Three', 86, 'male')
(3, 'Arnold', 'Three', 56, 'male')
(4, 'Krish Star', 'Four', 61, 'female')
(5, 'John Mike', 'Four', 61, 'female')
(6, 'Alex John', 'Four', 56, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 56, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Three', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 89, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark=mark+1 WHERE class='Four'"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount) 
  # row.count shows how many rows

No of records updated :  6

In [ ]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 77, 'female')
(2, 'Max Ruin', 'Three', 86, 'male')
(3, 'Arnold', 'Three', 56, 'male')
(4, 'Krish Star', 'Four', 62, 'female')
(5, 'John Mike', 'Four', 62, 'female')
(6, 'Alex John', 'Four', 57, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 57, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Three', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 90, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET class='Four' WHERE class='Three'"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)
  #updates the database, no more 3 only 4 are left

No of records updated :  3

In [ ]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 77, 'female')
(2, 'Max Ruin', 'Four', 86, 'male')
(3, 'Arnold', 'Four', 56, 'male')
(4, 'Krish Star', 'Four', 62, 'female')
(5, 'John Mike', 'Four', 62, 'female')
(6, 'Alex John', 'Four', 57, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 57, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Four', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 90, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
id=input("Enter student id : ")
my_data=(id,)
q="UPDATE student SET mark=mark+5 WHERE id=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)
  #parameters of the code can be updated

Enter student id : 1234
No of records updated :  0

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
my_data=('Six','Seven')
q="UPDATE student SET class=? WHERE class=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  4

In [ ]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 77, 'female')
(2, 'Max Ruin', 'Four', 86, 'male')
(3, 'Arnold', 'Four', 56, 'male')
(4, 'Krish Star', 'Four', 62, 'female')
(5, 'John Mike', 'Four', 62, 'female')
(6, 'Alex John', 'Four', 57, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 57, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Four', 82, 'female')
(28, 'Rojj Base', 'Six', 87, 'female')
(29, 'Tess Played', 'Six', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 90, 'male')
(32, 'Binn Rott', 'Six', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Six', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class)  FROM student"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Four
Five
Six
No of records displayed :  3

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class)  FROM student WHERE mark>=80"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Four
Five
Six
No of records displayed :  3

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class)  FROM student order by class"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Five
Four
Six
No of records displayed :  3

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT class,sex  FROM student order by class"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0],row[1])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Five male
Four female
Four male
Six male
Six female
No of records displayed :  5

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="DELETE FROM student WHERE id=5"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  1

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="DELETE FROM student WHERE class='Four'"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  8

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
my_data=("Five",)
q="DELETE FROM student WHERE class=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  2

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
my_data=("Six","Seven")
q="DELETE FROM student WHERE class=? OR class=? "
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  9

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="DELETE FROM student"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  0